import React from 'react';

const Questions = () => {
    return (
        <div>
            <h2>Questions-1: How Works React</h2>
            <p>Ans: আমরা সাধারণত ওয়েবসাইটে এইচটিএমএল, সিএসএস সহ জাভাস্ক্রিপ্ট ইউজ করি। এখন ব্রাউজার বিহ্যাইন্ড দ্যা সীনে একটা ডম ট্রি তৈরী করে যাতে ইউজার সেই ডমের সাথে ইন্টার‍্যাক্ট করতে পারে। ব্রাউজারের এই প্রসেসটাকে ক্রিটিক্যাল রেন্ডার পাথ বলে।</p>
            <h2>Questions-2: Props vs useState difference</h2>
            <p>Ans: প্রপস: এক উপাদান থেকে অন্য উপাদানে ডেটা প্রেরণ করতে ব্যবহৃত হয়।
                স্টেট: স্টেট হল একটি স্থানীয় ডেটা সঞ্চয়স্থান যা শুধুমাত্র উপাদানগুলির জন্য স্থানীয় এবং অন্যান্য উপাদানগুলিতে প্রেরণ করা যায় না। এবং প্রপার্টি কম্পোনেন্টের স্টেট ভ্যালু আপডেট করতে ব্যবহার করা হয়।</p>
        </div>
    );
};

export default Questions;